# Readme
============================================================================
## Lottto
+ Html과 JavaScript를 이용하여 제작된 로또 번호 추첨 프로그램
+ 45개의 숫자 중 7개가 랜덤하게 할당되고 각각의 색깔에 맞게 원의 형태로 구현됨

## cardgame
+ Html과 JavaScript를 이용하여 제작된 카드 짝 맞추기 게임
+ 두 개의 카드를 뒤집어서 색깔이 동일할 경우 고정되고, 다를 경우 다시 뒤집어짐 > 화면에 제시된 모든 카드의 짝을 맞추게 되면 맞추는 데에 걸린 시간이
제시됨과 동시에 게임이 종료됨

## pythongame-hangman
+ python을 이용하여 제작된 행맨 게임
+ 개발자가 미리 지정해둔 단어 중 하나가 랜덤하게 제시되며 알파벳을 한 자씩 입력하여 6번의 기회 안에 단어를 맞추는 게임

## webscraping
+ python을 이용하여 제작된 네이버 날씨, 네이버 IT뉴스 웹스크래핑
+ 프로그램을 실행할 경우 온도와 강수확률 등의 네이버 날씨와 실시간 IT뉴스 3개를 확인할 수 있음

  본래 미세먼지 정보를 받아오기 위해 변수를 dust로 설정하였으나 네이버 화면이 가끔씩 동일한 위치에 자외선 정보를 띄워주는 경우가 있어
  변수명을 rest로 처리함
  
## 식단 구성 프로그램
+ python을 이용하여 제작된 식단 구성 프로그램 'samsic'
+ 사용자로부터 아침, 점심, 저녁, 간식 정보를 각각 30번씩 입력받아 각각의 리스트에 저장한 후에, 사용자가 식단 정보를 원하면 
리스트에 저장된 값 중에서 랜덤으로 하나의 식단을 산출해줌

  회원정보를 설정하여 하루 권장 칼로리를 계산해주는 함수를 함께 제작하였으나 식단을 짤 때에 프로그램내에서 실질적인 영향을 미치지 않아
  삭제함
